Тестовая_база_ERP_14/src/DataProcessors/ФормированиеСменныхЗаданий/ФормированиеСменныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеСменныхЗаданий</name>
  <tabularSections>
    <name>ПодборОпераций</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>DocumentRef.ЭтапПроизводства2_2</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.ТехнологическиеОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Бригады</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <comment>Реквизит является справочным, так как рассчитывается с округлением на основании времени штучного и времени ПЗ</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполненияЕдИзм</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Тестовая_база_ERP_14/src/InformationRegisters/ОперацииКСозданиюСменныхЗаданий/ОперацииКСозданиюСменныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперацииКСозданиюСменныхЗаданий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения</name>
    <comment>Реквизит является справочным, так как рассчитывается с округлением на основании времени штучного и времени ПЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </resources>
  <resources>
    <name>МожноНазначать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НужноНазначать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НарушенПорядокНазначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующейОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменноеЗадание</name>
    <type>
      <types>DocumentRef.СменноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.ТехнологическиеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОперации</name>
    <comment>Уникальный идентификатор операции в маршрутной карте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Бригады</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабочегоЦентра</name>
    <type>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначатьНеРанее</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Catalogs/Бригады/Бригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Бригады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПрименятьРаспределениеПоКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/ТехнологическиеОперации/ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеОперации</name>
  <owners>Catalog.МаршрутныеКарты</owners>
  <attributes>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующейОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитВложенныйМаршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВложенныйМаршрут</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучноеЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.ВариантыНаладки</types>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Непрерывная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Уникальный идентификатор операции в маршрутной карте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПередаточнаяПартия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыТехнологическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноПовторить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноПропустить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВспомогательныеРабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативыВидаОперации</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/DataProcessors/ФормированиеСменныхЗаданий/Forms/НазначениеОпераций/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.КлючиОпераций) <> Тип("Массив")
		ИЛИ Параметры.КлючиОпераций.ВГраница() = -1 Тогда
		
		ВызватьИсключение НСтр("ru = 'Не переданы операции для назначения';
								|en = 'Operations to assign are not transferred'");
		
	КонецЕсли;
	
	КлючиОпераций = Параметры.КлючиОпераций;
	Подразделение = Параметры.Подразделение;
	
	ПараметрыПодразделения = ПроизводствоСервер.ПараметрыПроизводственногоПодразделения(Подразделение);
	ИспользоватьФизЛиц = ПараметрыПодразделения.ИспользоватьПерсональныеНаряды;
	ИспользоватьУчастки = ПараметрыПодразделения.ИспользоватьУчастки;
	
	Если НЕ Параметры.СменноеЗадание.Пустая() И ИспользоватьУчастки Тогда
		Участок = ЗначениеРеквизитаОбъекта(Параметры.СменноеЗадание, "Участок");
	КонецЕсли;
	
	ГрупповоеНазначение = КлючиОпераций.Количество() > 1;
	
	Если ГрупповоеНазначение Тогда
		
		Заголовок = СтрШаблон(НСтр("ru = 'Назначение операций (%1 шт)';
									|en = 'Operation assignment (%1 pcs)'"), КлючиОпераций.Количество());
		
		ОдинИсполнитель = Истина;
		ОдинВидРЦ       = Истина;
		ОдинРЦ          = Истина;
		
		Для Индекс = 1 По КлючиОпераций.ВГраница() Цикл
			
			ОдинИсполнитель = ОдинИсполнитель И КлючиОпераций[0].Исполнитель = КлючиОпераций[Индекс].Исполнитель;
			ОдинВидРЦ       = ОдинВидРЦ И КлючиОпераций[0].ВидРабочегоЦентра = КлючиОпераций[Индекс].ВидРабочегоЦентра;
			ОдинРЦ          = ОдинРЦ И КлючиОпераций[0].РабочийЦентр = КлючиОпераций[Индекс].РабочийЦентр;
			
		КонецЦикла;
		
		Если ОдинИсполнитель И НЕ КлючиОпераций[0].Исполнитель.Пустая() Тогда
			НазначитьИсполнителя = Истина;
			Исполнитель = КлючиОпераций[0].Исполнитель;
		КонецЕсли;
		
		Если ОдинВидРЦ И НЕ КлючиОпераций[0].ВидРабочегоЦентра.Пустая() Тогда
			НазначитьВидРабочегоЦентра = Истина;
			ВидРабочегоЦентра = КлючиОпераций[0].ВидРабочегоЦентра;
		КонецЕсли;
		
		Если ОдинРЦ
			И НЕ КлючиОпераций[0].РабочийЦентр.Пустая()
			И (Участок.Пустая() ИЛИ ЗначениеРеквизитаОбъекта(КлючиОпераций[0].РабочийЦентр, "Участок") = Участок) Тогда
			НазначитьРабочийЦентр = Истина;
			РабочийЦентр = КлючиОпераций[0].РабочийЦентр;
		КонецЕсли
		
	Иначе
		
		Заголовок = НСтр("ru = 'Назначение операции';
						|en = 'Operation assignment'");
		
		ДанныеОперации = ДанныеОперацииПоКлючу(КлючиОпераций[0], ИспользоватьФизЛиц);
		
		Если ДанныеОперации <> Неопределено Тогда
			
			ИсключаяСвойства = "";
			Если НЕ Участок.Пустая()
				И ЗначениеРеквизитаОбъекта(ДанныеОперации.РабочийЦентр, "Участок") <> Участок Тогда
				ИсключаяСвойства = "РабочийЦентр";
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОперации,, ИсключаяСвойства);
			
			ЕдиницаИзмеренияПредставление = УправлениеПроизводствомКлиентСервер.ПредставлениеЕдиницыИзмеренияОперации(
				ЕдиницаИзмерения, Количество);
			
			ЭтапПредставление = Документы.ЭтапПроизводства2_2.ПредставлениеЭтапа(Этап);
			
		КонецЕсли;
		
		НазначитьИсполнителя       = Истина;
		НазначитьВидРабочегоЦентра = Истина;
		НазначитьРабочийЦентр      = Истина;
		
		НазначитьЧасть = Параметры.НазначитьЧасть;
		
	КонецЕсли;
	
	Элементы.НазначитьИсполнителя.Видимость       = ГрупповоеНазначение;
	Элементы.НазначитьВидРабочегоЦентра.Видимость = ГрупповоеНазначение;
	Элементы.НазначитьРабочийЦентр.Видимость      = ГрупповоеНазначение;
	
	ПоказыватьЗаголовок = ?(ГрупповоеНазначение,
		ПоложениеЗаголовкаЭлементаФормы.Нет, ПоложениеЗаголовкаЭлементаФормы.Авто);
	Элементы.Исполнитель.ПоложениеЗаголовка       = ПоказыватьЗаголовок;
	Элементы.ВидРабочегоЦентра.ПоложениеЗаголовка = ПоказыватьЗаголовок;
	Элементы.РабочийЦентр.ПоложениеЗаголовка      = ПоказыватьЗаголовок;
	
	Элементы.Исполнитель.ПодсказкаВвода       = ?(ГрупповоеНазначение, НСтр("ru = 'Исполнитель';
																			|en = 'Assignee'"), "");
	Элементы.ВидРабочегоЦентра.ПодсказкаВвода = ?(ГрупповоеНазначение, НСтр("ru = 'Вид рабочего центра';
																			|en = 'Work center kind'"), "");
	Элементы.РабочийЦентр.ПодсказкаВвода      = ?(ГрупповоеНазначение, НСтр("ru = 'Рабочий центр';
																			|en = 'Work center'"), "");
	
	Элементы.Исполнитель.Доступность       = НазначитьИсполнителя;
	Элементы.ВидРабочегоЦентра.Доступность = НазначитьВидРабочегоЦентра;
	Элементы.РабочийЦентр.Доступность      = НазначитьРабочийЦентр;
	
	Элементы.Количество.Видимость                    = НЕ ГрупповоеНазначение;
	Элементы.ЕдиницаИзмеренияПредставление.Видимость = НЕ ГрупповоеНазначение;
	Элементы.ВремяВыполнения.Видимость               = НЕ ГрупповоеНазначение;
	Элементы.ВремяВыполненияЕдИзм.Видимость          = НЕ ГрупповоеНазначение;
	Элементы.Операция.Видимость                      = НЕ ГрупповоеНазначение;
	Элементы.МаршрутнаяКарта.Видимость               = НЕ ГрупповоеНазначение;
	Элементы.ЭтапПредставление.Видимость             = НЕ ГрупповоеНазначение;
	
	Если НЕ Параметры.СменноеЗадание.Пустая() Тогда
		СменноеЗадание = Параметры.СменноеЗадание;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Исполнитель) Тогда
		Исполнитель = Параметры.Исполнитель;
	ИначеЕсли Исполнитель = Неопределено Тогда
		Исполнитель = ?(ИспользоватьФизЛиц,
			Справочники.ФизическиеЛица.ПустаяСсылка(),
			Справочники.Бригады.ПустаяСсылка());
	КонецЕсли;
	
	Если НЕ Параметры.РабочийЦентр.Пустая()
		И (Участок.Пустая() ИЛИ ЗначениеРеквизитаОбъекта(Параметры.РабочийЦентр, "Участок") = Участок) Тогда
		РабочийЦентр = Параметры.РабочийЦентр;
	КонецЕсли;
	
	Если НЕ Параметры.ВидРабочегоЦентра.Пустая() Тогда
		ВидРабочегоЦентра = Параметры.ВидРабочегоЦентра;
	КонецЕсли;
	
	АдресКлючиОпераций = ПоместитьВоВременноеХранилище(КлючиОпераций, УникальныйИдентификатор);
	
	Если Параметры.ВыборИсполнителя Тогда
		ТекущийЭлемент = Элементы.Исполнитель;
	ИначеЕсли Параметры.ВыборРЦ Тогда
		ТекущийЭлемент = Элементы.РабочийЦентр;
	ИначеЕсли Параметры.ВыборВидаРЦ Тогда
		ТекущийЭлемент = Элементы.ВидРабочегоЦентра;
	ИначеЕсли Параметры.ВводКоличества Тогда
		ТекущийЭлемент = Элементы.Количество;
	Иначе
		ТекущийЭлемент = Элементы.СменноеЗадание;
	КонецЕсли;
	
	Связи = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый СвязьПараметраВыбора("Отбор.ВидРабочегоЦентра", "ВидРабочегоЦентра"));
	Если ИспользоватьУчастки Тогда
		Связи.Добавить(Новый СвязьПараметраВыбора("Отбор.Участок", "Участок"));
	КонецЕсли;
	Элементы.РабочийЦентр.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ГрупповоеНазначение Тогда
		
		Индекс = ПроверяемыеРеквизиты.Найти("Количество");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ НазначитьИсполнителя
		И НЕ НазначитьВидРабочегоЦентра
		И НЕ НазначитьРабочийЦентр Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не указан объект назначения';
				|en = 'Destination object is not specified'"),,,,
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СменноеЗаданиеПриИзменении(Элемент)
	
	Если ИспользоватьУчастки Тогда
		
		РабочийЦентр = Неопределено;
		
		Если НЕ СменноеЗадание.Пустая() Тогда
			
			Участок = ЗначениеРеквизитаОбъекта(СменноеЗадание, "Участок");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнительНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПроизводствоКлиент.ОткрытьФормуВыбораИсполнителя(
		,
		Подразделение,
		Исполнитель,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Исполнитель = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ЕдиницаИзмеренияПредставление = УправлениеПроизводствомКлиентСервер.ПредставлениеЕдиницыИзмеренияОперации(
		ЕдиницаИзмерения,
		Количество);
		
	Если КоличествоБаза <> 0 Тогда
		
		ВремяВыполнения = Количество * ВремяВыполненияБаза / КоличествоБаза;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяВыполненияПриИзменении(Элемент)
	
	Если ВремяВыполненияБаза <> 0 Тогда
		
		Количество = ВремяВыполнения * КоличествоБаза / ВремяВыполненияБаза;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьИсполнителяПриИзменении(Элемент)
	
	Элементы.Исполнитель.Доступность = НазначитьИсполнителя;
	
	Если НЕ НазначитьИсполнителя Тогда
		Исполнитель = ?(ИспользоватьФизЛиц,
			ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка"),
			ПредопределенноеЗначение("Справочник.Бригады.ПустаяСсылка"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьВидРабочегоЦентраПриИзменении(Элемент)
	
	Элементы.ВидРабочегоЦентра.Доступность = НазначитьВидРабочегоЦентра;
	
	Если НЕ НазначитьВидРабочегоЦентра Тогда
		
		ВидРабочегоЦентра = Неопределено;
		
		Если НазначитьРабочийЦентр Тогда
			
			НазначитьРабочийЦентр = Ложь;
			Элементы.РабочийЦентр.Доступность = Ложь;
			РабочийЦентр = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьРабочийЦентрПриИзменении(Элемент)
	
	Элементы.РабочийЦентр.Доступность = НазначитьРабочийЦентр;
	
	Если НЕ НазначитьРабочийЦентр Тогда
		РабочийЦентр = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(, Этап);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(НазначитьНаСервере());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеОперацииПоКлючу(КлючОперации, ИспользоватьФизЛиц)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Опеарции.СменноеЗадание КАК СменноеЗадание,
		|	Опеарции.Этап КАК Этап,
		|	ВЫБОР
		|		КОГДА Опеарции.Исполнитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|				И НЕ &ИспользоватьФизЛиц
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка)
		|		ИНАЧЕ Опеарции.Исполнитель
		|	КОНЕЦ КАК Исполнитель,
		|	Опеарции.РабочийЦентр КАК РабочийЦентр,
		|	Опеарции.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	Опеарции.Операция КАК Операция,
		|	Опеарции.Количество КАК Количество,
		|	Опеарции.Количество КАК КоличествоБаза,
		|	Опеарции.ВремяВыполнения КАК ВремяВыполнения,
		|	Опеарции.ВремяВыполнения КАК ВремяВыполненияБаза,
		|	Опеарции.ВремяВыполненияЕдИзм КАК ВремяВыполненияЕдИзм,
		|	ТехнологическиеОперации.Владелец КАК МаршрутнаяКарта,
		|	ТехнологическиеОперации.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Опеарции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО Опеарции.Операция = ТехнологическиеОперации.Ссылка
		|ГДЕ
		|	Опеарции.Подразделение = &Подразделение
		|	И Опеарции.Этап = &Этап
		|	И Опеарции.Операция = &Операция
		|	И Опеарции.ИдентификаторОперации = &ИдентификаторОперации
		|	И Опеарции.СменноеЗадание = &СменноеЗадание
		|	И Опеарции.Исполнитель = &Исполнитель
		|	И Опеарции.РабочийЦентр = &РабочийЦентр
		|	И Опеарции.ВидРабочегоЦентра = &ВидРабочегоЦентра
		|	И Опеарции.НазначатьНеРанее = &НазначатьНеРанее");
	
	Запрос.УстановитьПараметр("Подразделение", КлючОперации.Подразделение);
	Запрос.УстановитьПараметр("Этап", КлючОперации.Этап);
	Запрос.УстановитьПараметр("Операция", КлючОперации.Операция);
	Запрос.УстановитьПараметр("ИдентификаторОперации", КлючОперации.ИдентификаторОперации);
	Запрос.УстановитьПараметр("СменноеЗадание", КлючОперации.СменноеЗадание);
	Запрос.УстановитьПараметр("Исполнитель", КлючОперации.Исполнитель);
	Запрос.УстановитьПараметр("РабочийЦентр", КлючОперации.РабочийЦентр);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра", КлючОперации.ВидРабочегоЦентра);
	Запрос.УстановитьПараметр("НазначатьНеРанее", КлючОперации.НазначатьНеРанее);
	Запрос.УстановитьПараметр("ИспользоватьФизЛиц", ИспользоватьФизЛиц);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НазначитьНаСервере()
	
	КлючиОпераций = ПолучитьИзВременногоХранилища(АдресКлючиОпераций);
	
	ПараметрыНазначения = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.ПараметрыНазначенияОпераций();
	
	ПараметрыНазначения.Измерения.СменноеЗадание = СменноеЗадание;
	Если НазначитьИсполнителя Тогда
		ПараметрыНазначения.Измерения.Исполнитель = Исполнитель;
	КонецЕсли;
	Если НазначитьРабочийЦентр Тогда
		ПараметрыНазначения.Измерения.РабочийЦентр = РабочийЦентр;
	КонецЕсли;
	Если НазначитьВидРабочегоЦентра Тогда
		ПараметрыНазначения.Измерения.ВидРабочегоЦентра = ВидРабочегоЦентра;
	КонецЕсли;
	
	Если НЕ ГрупповоеНазначение Тогда
		ПараметрыНазначения.Количество = Количество;
		ПараметрыНазначения.НазначитьЧасть = НазначитьЧасть;
	КонецЕсли;
	
	РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.НазначитьОперации(
		КлючиОпераций,
		ПараметрыНазначения);
	
	Результат = Новый Структура;
	Результат.Вставить("СменноеЗадание", СменноеЗадание);
	Результат.Вставить("Исполнитель", Исполнитель);
	Результат.Вставить("РабочийЦентр", РабочийЦентр);
	Результат.Вставить("ВидРабочегоЦентра", ВидРабочегоЦентра);
	Результат.Вставить("КлючиОпераций", КлючиОпераций);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Подразделение", Подразделение);
	ПараметрыЗаполнения.Вставить("Организация", Неопределено);
	
	ПроизводствоСервер.ЗаполнитьДанныеВыбораПриВводеИсполнителя(ДанныеВыбора, Текст, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

#КонецОбласти
